import { NewsCard } from "@/shared";
import { Breadcrumbs } from "@/shared";

export default function Page() {
  return (
    <div className="py-4 pb-15 px-5">
      <div className="max-w-[1232px] mx-auto ">
        <div className="mb-6">
          <Breadcrumbs
            link1="/library"
            title1="مكتبة لبيب"
            link2="/articles"
            title2="تنظيم ورش عمل وفعاليات للاطفال"
          />
        </div>

        <div className="max-w-[1022px] mx-auto grid gap-4">
          <NewsCard
            title="تنظيم ورش عمل وفعاليات للاطفال"
            variant="articles"
            date="7 يوليو 2025"
            src="/post2.png"
            type="article"
          />
          <div className="flex flex-col gap-8 border-t border-grey py-2 border-b ">
            <p className="text-primary-default">
              في مكتبة لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام.
              هنا، تُنسج النصائح والدراسات والمقالات في رحلة فريدة، في مكتبة
              لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا،
              تُنسج النصائح والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب،
              تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج
              النصائح والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ
              حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة،{" "}
            </p>

            <p className="text-primary-default">
              في مكتبة لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام.
              هنا، تُنسج النصائح والدراسات والمقالات في رحلة فريدة، في مكتبة
              لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا،
              تُنسج النصائح والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب،
              تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج
              النصائح والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ
              حكايات الطفل بالحب وتنمو مع المعرفة والإلهام.، في مكتبة لبيب، تبدأ
              حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح
              والدراسات والمقالات في رحلة فريدة، في مكتبة لبيب، تبدأ حكايات
              الطفل بالحب وتنمو مع المعرفة والإلهام.{" "}
            </p>
            <div className="flex gap-2 items-center">
              <p>مشاركة:</p>
              <div className="flex gap-2">
                <a href="#">
                  <img src="/facebook-01.svg" alt="facebook" />
                </a>
                <a href="#">
                  <img src="/snapchat-color.svg" alt="twitter" />
                </a>
                <a href="#">
                  <img src="/new-twitter.svg" alt="twitter" />
                </a>
                <a href="#">
                  <img src="/whatsapp2.svg" alt="twitter" />
                </a>
                <a href="#">
                  <img src="/linkedin-01.svg" alt="twitter" />
                </a>
                <a href="#">
                  <img src="/telegram.svg" alt="twitter" />
                </a>

                <a href="#">
                  <img src="/pinterest.svg" alt="twitter" />
                </a>
                <a href="#">
                  <img src="/tumblr.svg" alt="twitter" />
                </a>
              </div>
            </div>
          </div>

          <div className="grid gap-4">
            <div className="h4-bold">مقالات قد تهمك!</div>
            <div className="grid lg:grid-cols-2 gap-4">
              <NewsCard
                title="تنظيم ورش عمل وفعاليات للاطفال"
                description="في مكتبة لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح والدراسات والمقالات في رحلة فريدة"
                date="7 يوليو 2025"
                src="/post3.png"
                className="max-h-[200px] lg:max-h-[140px]"
              />
              <NewsCard
                title="تنظيم ورش عمل وفعاليات للاطفال"
                description="في مكتبة لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح والدراسات والمقالات في رحلة فريدة"
                date="7 يوليو 2025"
                src="/post3.png"
                className="max-h-[200px] lg:max-h-[140px]"
              />
              <NewsCard
                title="إقامة زيارات مدرسية توعوية تثقيفية"
                description="في مكتبة لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح والدراسات والمقالات في رحلة فريدة"
                date="7 يوليو 2025"
                src="/post2.png"
                className="max-h-[200px] lg:max-h-[140px]"
              />
              <NewsCard
                title="إقامة زيارات مدرسية توعوية تثقيفية"
                description="في مكتبة لبيب، تبدأ حكايات الطفل بالحب وتنمو مع المعرفة والإلهام. هنا، تُنسج النصائح والدراسات والمقالات في رحلة فريدة"
                date="7 يوليو 2025"
                className="max-h-[200px] lg:max-h-[140px]"
                src="/post2.png"
              />
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}
