import React from "react";
import { Breadcrumbs } from "@/shared";

export default function Page() {
  const termsAndConditions = [
    {
      title: "1. المقدمة",
      description:
        "تنطبق هذه الشروط والأحكام على هذا الموقع وعلى المعاملات المتعلقة بمنتجاتنا وخدماتنا. قد تكون ملزمًا بالعقود الإضافية المتعلقة بعلاقتك معنا أو أي منتجات أو خدمات تتلقاها منا. في حالة تعارض أي من أحكام العقود الإضافية مع أي من أحكام هذه الشروط ، فإن أحكام هذه العقود الإضافية ستسود.",
    },
    {
      title: "2. ملزم",
      description:
        "بالتسجيل في هذا الموقع أو الوصول إليه أو استخدامه بأي طريقة أخرى، فإنك توافق بموجب هذا على الالتزام بهذه الشروط والأحكام الموضحة أدناه. إن مجرد استخدام هذا الموقع يعني معرفة وقبول هذه الشروط والأحكام. في بعض الحالات الخاصة ، يمكننا أيضًا مطالبتك بالموافقة الصريحة.",
    },
    {
      title: "3. الاتصالات الإلكترونية",
      description:
        "باستخدام هذا الموقع أو التواصل معنا بالوسائل الإلكترونية، فإنك توافق وتقر بأننا قد نتواصل معك إلكترونيًا على موقعنا الإلكتروني أو عن طريق إرسال بريد إلكتروني إليك، وتوافق على أن جميع الاتفاقيات والإشعارات والإفصاحات والمراسلات الأخرى التي نقوم بها تزويدك إلكترونياً بإيفاء أي متطلبات قانونية، بما في ذلك على سبيل المثال لا الحصر شرط أن تكون هذه الاتصالات مكتوبة.",
    },
    {
      title: "4. الملكية الفكرية",
      description:
        "نحن أو المرخصون لدينا نملك ونتحكم في جميع حقوق الطبع والنشر وحقوق الملكية الفكرية الأخرى في موقع الويب والبيانات والمعلومات والموارد الأخرى المعروضة بواسطة الموقع أو التي يمكن الوصول إليها من خلاله.",
    },
    {
      title: "4.1 جميع الحقوق محفوظة",
      description:
        "ما لم ينص محتوى معين على خلاف ذلك، لا يتم منحك ترخيصًا أو أي حق آخر بموجب حقوق النشر أو العلامات التجارية أو براءات الاختراع أو حقوق الملكية الفكرية الأخرى. هذا يعني أنك لن تستخدم أو تنسخ أو تعيد إنتاج أو تؤدي أو تعرض أو توزع أو تضمِّن في أي وسيط إلكتروني، أو تغير، أو تقوم بهندسة عكسية، أو تفكك، أو تحمل، أو تنقل، أو تحول، أو تربح، أو تبيع، أو تسوق، أو تتاجر في أي موارد على هذا الموقع. بأي شكل من الأشكال، دون إذن كتابي مسبق منا، باستثناء وفقط بقدر ما هو منصوص عليه في لوائح القانون الإلزامي (مثل الحق في الاقتباس).",
    },
    {
      title: "5. النشرة الإخبارية",
      description:
        "على الرغم مما سبق، يمكنك إرسال رسالتنا الإخبارية في شكل إلكتروني للآخرين الذين قد يكونون مهتمين بزيارة موقعنا.",
    },
    {
      title: "6. ممتلكات الطرف الثالث",
      description:
        "قد يحتوي موقعنا على ارتباطات تشعبية أو مراجع أخرى لمواقع الطرف الآخر. نحن لا نراقب أو نراجع محتوى مواقع الأطراف الأخرى المرتبطة من هذا الموقع. تخضع المنتجات أو الخدمات التي تقدمها مواقع الويب الأخرى للشروط والأحكام المعمول بها لتلك الأطراف الثالثة. الآراء المعبر عنها أو المواد التي تظهر على تلك المواقع ليست بالضرورة مشتركة أو معتمدة من قبلنا. لن نكون مسؤولين عن أي ممارسات خصوصية أو محتوى لهذه المواقع. أنت تتحمل جميع المخاطر المرتبطة باستخدام هذه المواقع وأي خدمات طرف ثالث ذات صلة. لن نتحمل أي مسؤولية عن أي خسارة أو ضرر بأي طريقة، مهما كان سببها، ناتج عن إفصاحك لأطراف ثالثة عن معلومات شخصية.",
    },
  ];

  return (
    <>
      <Breadcrumbs />
      <div className="px-[20px] pb-[100px]">
        <div className="max-w-[1440px] mx-auto">
          <div className="flex flex-col gap-[24px]">
            <h1 className="h1-bold">الشروط والأحكام</h1>

            <div className="titles-medium">
              تم آخر تحديث للشروط والأحكام بتاريخ 2023-07-24
            </div>
            <div className="flex flex-col gap-[24px]">
              {termsAndConditions.map((item, index) => (
                <div key={index}>
                  <h2 className="title-bold">{item.title}</h2>
                  <p className="body-light">{item.description}</p>
                </div>
              ))}
            </div>
          </div>
        </div>{" "}
      </div>
    </>
  );
}
